tutorials/Rotational/wind/11_wing_listSpring_RayleighDamping/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          1.0e-6;

writeControl    timeStep;//adjustable;

writeInterval   200;//1e-2;

purgeWrite      5;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   12;

runTimeModifiable true;

adjustTimeStep  no;//yes;

//maxCo           0.9;

libs
(
    "libinterExtrapolateSplineXY.so"
    "libinterExtrapolationTable.so"
    "libnonLinearAxialAngularSpring.so"
);

functions
{
    sixDoFRigidBodyState
    {
        type           sixDoFRigidBodyState;
        libs           (sixDoFRigidBodyState);
        angleFormat    degrees;
    }
    
    #include "forceCoeffs"
}


// ************************************************************************* //
